final version of increment-1
